app/controllers/answers_controller.rb

  def create
      @answer = Answer.new(responder_id: session[:user_id], question_id: params[:id], description: params[:answer_name])
      if @answer.save
---
INSERT INTO "answers" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "test ans"], ["created_at", "2016-03-28 08:40:19.181474"], ["updated_at", "2016-03-28 08:40:19.181474"]]