app/controllers/comments_controller.rb

INSERT INTO "comments" ("commentable_type", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["commentable_type", "Question"], ["description", "test"], ["created_at", "2016-03-28 08:39:33.010078"], ["updated_at", "2016-03-28 08:39:33.010078"]]
---
  def create
    @comment = Comment.new(commenter_id: session[:user_id], commentable_id: params[:id], commentable_type: "Question", description: params[:comment_name])
      if @comment.save