app/controllers/questions_controller.rb

  def index
  	@user = User.find(session[:id])
  	@questions = Question.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
SELECT "questions".* FROM "questions"

  def show
    @user = User.find(session[:id])
    @question = Question.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]