app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 21]]
---
  def show
    if session[:id]
      # All user's questions
      @user = User.find_by(id: params[:id])

INSERT INTO "users" ("email", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "test@tester.com"]]
---
  def create
    @user = User.new(email: params[:email], username: params[:username], password: params[:password])

    if @user.save
      session[:id] = @user.id
      redirect_to '/questions'
      # redirect_to "/users/#{@user.id}"
    elsif @user.id == nil
      redirect_to "/users/new?errors=#{@user.errors.full_messages.join(" and ")}"